{
	"1,Цели тестирования, выделить главную": "Главная цель тестирования-поиск ошибок ПО; Предоставление информации о качестве ПО конечному заказчику; Повышение качества ПО; Предотвращение появления дефектов.
",
	"2. Цели, в зависимости от того, когда вы начали тестирование фича, конечный продукт, регресс, смок и т.д. Зачем мы проводим данные тесты? Какова их цель?": "Фича-используется в игровой индустрии(необычное поведение персонажей, внезапные сюжетные ходы), в ПО(кардинально новое оформление интерфейса), в создании сайтов (подсказки и фильтры, нестандартные визуализации и др.).
цели: увеличение числа пользователей, приобретающих платную подписку, или отрыв от конкурентов); Конечный продукт- последняя стадия тестирования, на проверку отсутствия ошибок в программe; цели: сдать заказчику готовую, рабочую программу без дефектов; Регресс- направлено на проверку изменений в программе (починка дефекта, слияние кода, миграция на другую ОС и др; цели: удостовериться в том, что существующая функциональность не была затронута изменениями в коде; Смок-краткий цикл тестов, проводимых на начальном этапе направленных на проверку готовности продукта к проведению более расширенного тестирования; цели: подтвердить факт запуска и выполнения функций устанавливаемого приложения после сборки нового или редактируемого кода",
	"3.Принципы тестирования": "Тестирование показывает наличие дефектов- может показать наличие дефектов но не доказать их отсутствие; Исчерпывающее тестирование невозможно- невозможно провести исчерпывающее тестирование, которое бы покрывало все возможные комбинации пользовательского ввода; Раннее тестирование- тестирование должно начинаться как можно раньше; Скопление дефектов- разные модули системы могут содержать разное кол-во дефектов.; Парадокс пестицида- прогоняя одни и те же тесты вновь и вновь, вы столкнетесь с тем, что они находят все меньше новых ошибок.; Тестирование зависит от контекста- выбор методологии, техники и типа тестирования будет напрямую зависеть от природы самой программы; Заблуждение роб отсутствии ошибок-тот факт, что тестирование не обнаружило дефектов, не значит, что программа готова к релизу.",
	"4. Типы или виды тестирования": "Функциональные- проверка способности ПО в определенных условиях решать задачи, нужные пользователям; Нефункциональные-тестирование качественных характеристик компонента или системы, которые могут быть быть измерены различными величинами, не относящихся к конкретной функции. Позволяет определить работоспособность системы при различных условиях; Связанные с изменениями- тестирование, проводимое после необходимых изменений, таких как исправление дефектов."
}
